[
  {
    "id": 1,
    "imagem": "/assets/harry.webp",
    "name": "Harry Potter",
    "house": "Gryffindor",
    "patronus": "Cervo",
    "description": "O Menino que Sobreviveu, principal protagonista da série.",
    "resume": "Harry Tiago Potter é um bruxo inglês mestiço nascido em 31 de julho de 1980. O único filho de Tiago e Lílian Potter teve seu nascimento ofuscado por uma profecia que referia-se a si mesmo, ou a Neville Longbottom, como aquele com o poder de derrotar o Lorde das Trevas. Harry foi estabelecido como alvo após Severo Snape delatar toda a previsão a Voldemort, notando-se que havia algumas semelhanças entre a criança e o Lorde das Trevas."
  },
  {
    "id": 2,
    "imagem": "/assets/Hermione.webp",
    "name": "Hermione Granger",
    "house": "Gryffindor",
    "patronus": "Lontra",
    "description": "Uma das melhores amigos de Harry, conhecido por sua inteligência e desenvoltura.",
    "resume": "A Ministra da Magia Hermione Jean Granger, nascida em 19 de setembro de 1979, é uma bruxa inglesa nascida trouxa e a única filha do Sr. e da Sra. Granger. Aos onze anos de idade, quando aprendeu sobre sua natureza mágica, Hermione foi aceita na Escola de Magia e Bruxaria de Hogwarts. Ela iniciou seus estudos em 1991 e foi classificada para a Casa Grifinória. Hermione possuía uma mente acadêmica brilhante e se provou uma estudante talentosa em quase todas as matérias que estudou, a ponto de ser considerada à Casa Corvinal quando classificada pelo Chapéu Seletor. No entanto, sua disposição cética e lógica foi uma das características que o fez mudar de ideia."
  },
  {
    "id": 3,
    "imagem": "/assets/ronald-weasley.webp",
    "name": "Ron Weasley",
    "house": "Gryffindor",
    "patronus": "Jack Russell Terrier",
    "description": "O amigo leal de Harry, de uma grande e amorosa família bruxa.",
    "resume": "Ronald Abílio Weasley, mais conhecido como Rony, é um bruxo inglês sangue puro nascido em 1 de março de 1980 e o sexto filho de Arthur e Molly Weasley. Ele também é o irmão mais novo de Gui, Carlinhos, Percy, Fred e Jorge e o irmão mais velho de Gina. Rony cresceu junto de seus irmãos n'A Toca, pelos arredores de Ottery St. Catchpole em Devon."
  },
  {
    "id": 4,
    "imagem": "/assets/Severus.webp",
    "name": "Severus Snape",
    "house": "Slytherin",
    "patronus": "Corça",
    "description": "Mestre de Poções e um personagem complicado que desempenhou um papel fundamental na história de Harry.",
    "resume": "O Professor Severo Snape (9 de janeiro de 1960 – 2 de maio de 1998) foi um bruxo mestiço, filho da bruxa Eileen Snape (nascida Prince) e o trouxa Tobias Snape. Durante sua vida, Severo Snape foi Mestre de Poções (1981–1996), o professor de Defesa Contra as Artes das Trevas (ano letivo 1996-1997), e Diretor (ano letivo 1997-1998) da Escola de Magia e Bruxaria de Hogwarts (que ele frequentou como aluno de 1971 a 1978). Ele também foi um membro da Ordem da Fênix, e teve um papel muito importante em ambas as Guerras Bruxas contra Lord Voldemort."
  },
  {
    "id": 5,
    "imagem": "/assets/Albus-dumbledore.webp",
    "name": "Albus Dumbledore",
    "house": "Gryffindor",
    "patronus": "Phoenix",
    "description": "O sábio e poderoso diretor de Hogwarts.",
    "resume": "O Professor Alvo Percival Wulfrico Brian Dumbledore, Ordem de Merlin, Primeira Classe, (Grande Feiticeiro), (Bruxo Chefe), (Cacique Supremo), (Confederação Internacional dos Bruxos) (verão de 1881–30 de junho de 1997), foi um bruxo inglês mestiço que ocupou o cargo de professor nas matérias de Defesa Contra as Artes das Trevas e Transfiguração, bem como diretor, na Escola de Magia e Bruxaria de Hogwarts. Ele também atuou como Cacique Supremo da Confederação Internacional dos Bruxos (?–1995) e Bruxo Chefe da Suprema Corte dos Bruxos (?–1995;1996–1997). Um bruxo que apoiava os direitos dos trouxas, embora o oposto completo durante sua juventude, que foi considero o maior bruxos dos tempos modernos e, talvez, de todos os tempos."
  },
  {
    "id": 6,
    "imagem": "/assets/lord-voldemort.webp",
    "name": "Lord Voldemort",
    "house": "Slytherin",
    "patronus": "Nenhum",
    "description": "O principal antagonista da série, obcecado em vencer a morte e se tornar o bruxo mais poderoso.",
    "resume": "Tom Servolo Riddle (31 de dezembro de 1926 – 2 de maio de 1998), mais tarde (e mais) conhecido como Lord Voldemort, foi um bruxo mestiço considerado o mais poderoso bruxo das trevas de todos os tempos.[2] Ele era filho do rico trouxa Tom Riddle e da bruxa Mérope Gaunt, que morreu pouco após o parto. Seu pai, Tom Riddle, deixou sua esposa logo depois que ela ficou grávida de seu filho, tendo sido liberado do encantamento de uma poção do amor com a qual tinham iniciado a sua relação. Tom Servolo Riddle nasceu e cresceu em um orfanato trouxa. Mais tarde ingressou na Escola de Magia e Bruxaria de Hogwarts e foi selecionado para a casa Sonserina."
  },
  {
    "id": 7,
    "imagem": "/assets/draco-malfoy.webp",
    "name": "Draco Malfoy",
    "house": "Slytherin",
    "patronus": "Desconhecido",
    "description": "Rival de Harry em Hogwarts, conhecido por seu status de sangue puro e associação com Comensais da Morte.",
    "resume": "Draco Lúcio Malfoy é um bruxo sangue puro britânico nascido em 5 de junho de 1980 e o único filho de Lúcio e Narcisa Malfoy. Sendo filho de um Comensal da Morte, o garoto foi criado para acreditar fortemente na importância da pureza de sangue. Ele frequentou a Escola de Magia e Bruxaria de Hogwarts dentre 1991–1998 e foi classificado para a Casa Sonserina. Durante seus anos escolares, Draco se tornou amigo de Vicente Crabbe, Gregório Goyle, Pansy Parkinson e alguns outros Sonserinos — desenvolvendo assim, uma rápida rivalidade com Harry Potter."
  },
  {
    "id": 8,
    "imagem": "/assets/sirius-black.webp",
    "name": "Sirius Black",
    "house": "Gryffindor",
    "patronus": "Cachorro",
    "description": "O padrinho de Harry, preso injustamente em Azkaban, mas mais tarde revelou-se inocente.",
    "resume": "Sirius Black III (3 de novembro de 1959–18 de junho de 1996), também conhecido como Almofadinhas ou Snuffles (em sua forma animaga), foi um bruxo inglês sangue puro, o filho mais velho de Orion e Walburga Black, o irmão de Régulo Black e o padrinho de Harry Potter. Embora fosse o herdeiro da Casa dos Black, Sirius discordava vigorosamente das crenças e preceitos de sua linhagem, desafiando sua tradição familiar ao ser classificado para a Casa Grifinória ao invés de Sonserina na Escola de Magia e Bruxaria de Hogwarts, a qual ele frequentou entre 1971–1978."
  },
  {
    "id": 9,
    "imagem": "/assets/luna-lovegood.webp",
    "name": "Luna Lovegood",
    "house": "Ravenclaw",
    "patronus": "Lebre",
    "description": "Uma estudante peculiar e de bom coração, conhecida por sua perspectiva única e lealdade a Harry.",
    "resume": "Luna Scamander (nascida Lovegood) é uma bruxa britânica nascida em 13 de fevereiro de 1981 e a única filha de Xenofílio e Pandora Lovegood. Durante um acidente com alguns experimentos, sua mãe faleceu quando Luna tinha nove anos e, consequentemente, a garota foi criada pelo pai, o editor da revista O Pasquim, em uma casa semelhante a uma torre pelos arredores de Ottery St. Catchpole, em Devon, Inglaterra."
  }
]
